Revit 2024 API
BuiltInFailures.InaccurateFailures.InaccurateCurveBasedFamily Property
 Curve-Based Family is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InaccurateCurveBasedFamily { get; }
Visual Basic
Public Shared ReadOnly Property InaccurateCurveBasedFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InaccurateCurveBasedFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace